app/controllers/home_controller.rb

  def index
    @last_tip  = Tip.by_creation.last
    @productos = Producto.by_creation.last
    @tips      = Tip.by_creation.limit(4)
---
SELECT `tips`.* FROM `tips` ORDER BY created_at DESC LIMIT 1
SELECT `productos`.* FROM `productos` ORDER BY created_at DESC LIMIT 1
SELECT `productos`.* FROM `productos` WHERE (descuento > 0) ORDER BY created_at LIMIT 4
SELECT `tips`.* FROM `tips` ORDER BY created_at LIMIT 4