app/controllers/tips_controller.rb

    def index
        @tips = Tip.by_creation.limit(20)
---
SELECT `tips`.* FROM `tips`

    def show
        @tip = Tip.find(params[:id])
---
SELECT `tips`.* FROM `tips` WHERE `tips`.`id` = 3 LIMIT 1